[{"title":"Hello World","date":"2017-08-23T09:52:06.470Z","path":"2017/08/23/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment hexo生成博文插入图片1234567891011121314151617First1 把主页配置文件_config.yml 里的post_asset_folder:这个选项设置为true2 在你的hexo目录下执行这样一句话npm install hexo-asset-image --save，这是下载安装一个可以上传本地图片的插件，来自dalao：dalao的git3 等待一小段时间后，再运行hexo n \"xxxx\"来生成md博文时，/source/_posts文件夹内除了xxxx.md文件还有一个同名的文件夹Second4 最后在xxxx.md中想引入图片时，先把图片复制到xxxx这个文件夹中，然后只需要在xxxx.md中按照markdown的格式引入图片：![你想输入的替代文字](xxxx/图片名.jpg)**注意：**xxxx是这个md文件的名字，也是同名文件夹的名字，你想引入的图片就只需要放入xxxx这个文件夹内就好了，很像引用相对路径。5 最后检查一下，hexo g生成页面后，进入public\\2017\\02\\26\\index.html文件中查看相关字段，可以发现，html标签内的语句是&lt;img src=\"2017/02/26/xxxx/图片名.jpg\"&gt;，而不是&lt;img src=\"xxxx/图片名.jpg&gt;。这很重要，关乎你的网页是否可以真正加载你想插入的图片。","tags":[]},{"title":"raven","date":"2017-08-23T03:41:53.000Z","path":"2017/08/23/raven/","text":"链接 http://astro.ee.washington.edu/ravenIIwiki http://applieddexterity.com/ 代码 https://gitlab.com/sdurobotics-surgical/raven2.git https://github.com/uw-biorobotics/raven2.git 器件 http://www.geomagic.com/en/products/phantom-omni/overview https://www.ascension-tech.com/","tags":[]},{"title":"AI_links","date":"2017-08-16T03:22:48.000Z","path":"2017/08/16/AI-links/","text":"人工智能、深度学习、语音识别、图像识别，等。 deep learning 神经网络 GitHub 上 57 款最流行的开源深度学习项目 TensorFlow 官方文档中文版 tensorflow git 地址 语音识别 nodejs 语义识别相关模块 科大讯飞语音识别SDK对硬件的要求：离线命令词识别需要RAM至少预留128M，唤醒需要RAM至少预留20M，服务对CPU的要求，需要相当于单核800MHz的水平 几个常见的语音交互平台的简介和比较 图像识别 40多个关于人脸检测/识别的API、库和软件 TensorBox(a simple framework for training neural networks to detect objects in images) tensorflow for poets Number plate recognition with Tensorflow Using TensorFlow for Object Recognition Ubuntu 14.04下Openface的环境搭建 在tensorflow上运行facenet 扫地机器人 基于Dashgo的ROS版树莓派3的使用教程 SLAM的前世今生 谷歌近期开源的 SLAM 方案 学习SLAM需要哪些预备知识 ROS 学习系列 – RViz 实时观测机器人建立导航2D封闭空间地图过程 (SLAM) Neato XV-11激光雷达资料及使用heactor_slam（详细） B(erkeley) L(ocalization) A(nd) M(apping) NLP Text summarization with TensorFlow TensorFlow 自动文本摘要生成模型,2016 深度解析MetaMind文本摘要新研究 5 open source tools for taming text How to Run Text Summarization with TensorFlow Online summarize tool 基于TextRank的中文摘要工具 Automatic summarization 文本自动摘要工具 TextTeaser 开源 使用TextRank算法为文本生成关键字和摘要 从头条的张小明（xiaomingbot）带你看各种新闻机器人 Text Summarization in Python: Extractive vs. Abstractive techniques revisited Deep Learning NLP Pipeline implemented on Tensorflow NLP+词法系列（一）︱中文分词技术小结、几大分词引擎的介绍与比较","tags":[]},{"title":"Pycharm","date":"2017-03-16T07:00:32.000Z","path":"2017/03/16/Pycharm/","text":"怎样在ubuntu14.04上安装pycharmpycharm是一款为python开发而生的IDE。它已经被专家认为是最好的pythonIDE之一。pycharm有社区版和专业版两种。社区版是免费的。但是专业版有更多的功能。我在下面的教程中展示如何安装这两种pycharm。 pycharm特点在展示如何安装pycharm之前，让我们看一看pycharm的特点： 语法高亮自动缩进和代码格式化代码补全行、块注释错误处高亮代码预置代码折叠代码导航搜索代码分析配置语言内置python重整文档自动保存完整的功能列表都可以在这里找到。你可以阅读专业版与社区版的比较来决定哪个版本更适合你。安装pycharm使用umake来安装pycharm。 Ubuntu为开发者提供了一个完美的命令行工具——umake。umake可以让你在Ubuntu上轻松的安装一大堆开发工具。例如 Android Studio, Visual Studio Code, Ubuntu SDK, Eclipse, Arudino Software Distribution等等。pycharm也是其中之一。 首先你需要安装umake。一般来说，umake已经在Ubuntu上预先安装好了，但是如果没有安装的话（我的系统没有），可以使用PPA来得到umake最新的稳定版本。 sudo add-apt-repository ppa:ubuntu-desktop/ubuntu-makesudo apt-get updatesudo apt-get install ubuntu-make一旦你有了umake，可以使用以下命令来安装pycharm社区版： umake ide pycharm下面命令用来安装专业版： umake ide pycharm-professional安装完成之后，去Unity Dash 搜索Pycharm。 卸载pycharm通过umake来卸载pycharm umake -r ide pycharm这就是你所要做的全部事情。希望这篇教程可以帮助完成安装pycharm！","tags":[]}]